data/logs/SAMPLE_JOB-100/fio/RHEL6.7/8k/O_SYNC_RandWrite.log
thread-1: (g=0): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=sync, iodepth=1
thread-2: (g=1): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=sync, iodepth=1
...
thread-4: (g=2): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=sync, iodepth=1
...
thread-8: (g=3): rw=randwrite, bs=8K-8K/8K-8K/8K-8K, ioengine=sync, iodepth=1
...
fio-2.2.9
Starting 15 processes

thread-1: (groupid=0, jobs=1): err= 0: pid=6049: Tue Oct 27 21:28:30 2015
  write: io=4096.0MB, bw=36054KB/s, iops=4506, runt=116333msec
    clat (usec): min=46, max=88825, avg=219.44, stdev=793.64
     lat (usec): min=46, max=88826, avg=219.73, stdev=793.64
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   49], 10.00th=[   50], 20.00th=[   50],
     | 30.00th=[   51], 40.00th=[   52], 50.00th=[   52], 60.00th=[   53],
     | 70.00th=[   55], 80.00th=[  262], 90.00th=[  748], 95.00th=[  972],
     | 99.00th=[ 1544], 99.50th=[ 1880], 99.90th=[ 4384], 99.95th=[ 4704],
     | 99.99th=[ 6688]
    bw (KB  /s): min= 5536, max=148368, per=100.00%, avg=36066.81, stdev=30269.25
    lat (usec) : 50=7.21%, 100=67.88%, 250=4.71%, 500=3.90%, 750=6.30%
    lat (usec) : 1000=5.36%
    lat (msec) : 2=4.22%, 4=0.29%, 10=0.11%, 20=0.01%, 100=0.01%
  cpu          : usr=1.43%, sys=10.12%, ctx=524343, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=524288/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=6069: Tue Oct 27 21:28:30 2015
  write: io=2048.0MB, bw=11477KB/s, iops=1434, runt=182734msec
    clat (usec): min=45, max=91831, avg=694.34, stdev=1500.94
     lat (usec): min=45, max=91832, avg=694.68, stdev=1500.95
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   51], 20.00th=[   53],
     | 30.00th=[   55], 40.00th=[   59], 50.00th=[  354], 60.00th=[  764],
     | 70.00th=[  980], 80.00th=[ 1304], 90.00th=[ 1720], 95.00th=[ 2064],
     | 99.00th=[ 2896], 99.50th=[ 4256], 99.90th=[ 5856], 99.95th=[ 6624],
     | 99.99th=[85504]
    bw (KB  /s): min= 3424, max=28272, per=49.89%, avg=11451.25, stdev=4199.03
    lat (usec) : 50=2.44%, 100=41.81%, 250=4.05%, 500=3.70%, 750=7.41%
    lat (usec) : 1000=11.29%
    lat (msec) : 2=23.73%, 4=5.05%, 10=0.51%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.02%
  cpu          : usr=0.51%, sys=3.57%, ctx=262673, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=6070: Tue Oct 27 21:28:30 2015
  write: io=2048.0MB, bw=11500KB/s, iops=1437, runt=182359msec
    clat (usec): min=42, max=90539, avg=692.94, stdev=1500.10
     lat (usec): min=43, max=90539, avg=693.28, stdev=1500.10
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   51], 20.00th=[   53],
     | 30.00th=[   54], 40.00th=[   59], 50.00th=[  342], 60.00th=[  764],
     | 70.00th=[  980], 80.00th=[ 1304], 90.00th=[ 1720], 95.00th=[ 2040],
     | 99.00th=[ 2896], 99.50th=[ 4192], 99.90th=[ 5920], 99.95th=[ 6752],
     | 99.99th=[85504]
    bw (KB  /s): min= 3449, max=28240, per=50.09%, avg=11497.40, stdev=4115.16
    lat (usec) : 50=2.26%, 100=42.32%, 250=4.00%, 500=3.59%, 750=7.37%
    lat (usec) : 1000=11.12%
    lat (msec) : 2=23.80%, 4=5.02%, 10=0.50%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.02%
  cpu          : usr=0.50%, sys=3.59%, ctx=262707, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=6104: Tue Oct 27 21:28:30 2015
  write: io=1024.0MB, bw=5583.6KB/s, iops=697, runt=187798msec
    clat (usec): min=42, max=94797, avg=1429.35, stdev=2295.90
     lat (usec): min=42, max=94798, avg=1429.84, stdev=2295.90
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   56],
     | 30.00th=[   92], 40.00th=[  732], 50.00th=[ 1240], 60.00th=[ 1688],
     | 70.00th=[ 2064], 80.00th=[ 2512], 90.00th=[ 3120], 95.00th=[ 3664],
     | 99.00th=[ 5472], 99.50th=[ 6368], 99.90th=[ 8384], 99.95th=[18560],
     | 99.99th=[88576]
    bw (KB  /s): min= 1724, max=19960, per=25.02%, avg=5573.77, stdev=2142.44
    lat (usec) : 50=1.81%, 100=29.23%, 250=4.69%, 500=1.98%, 750=2.52%
    lat (usec) : 1000=4.99%
    lat (msec) : 2=22.98%, 4=28.36%, 10=3.37%, 20=0.02%, 100=0.05%
  cpu          : usr=0.35%, sys=1.98%, ctx=131933, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=6105: Tue Oct 27 21:28:30 2015
  write: io=1024.0MB, bw=5588.1KB/s, iops=698, runt=187617msec
    clat (usec): min=44, max=94467, avg=1427.89, stdev=2292.93
     lat (usec): min=44, max=94467, avg=1428.41, stdev=2292.93
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   57],
     | 30.00th=[   93], 40.00th=[  732], 50.00th=[ 1224], 60.00th=[ 1688],
     | 70.00th=[ 2064], 80.00th=[ 2512], 90.00th=[ 3120], 95.00th=[ 3664],
     | 99.00th=[ 5472], 99.50th=[ 6368], 99.90th=[ 8512], 99.95th=[16512],
     | 99.99th=[88576]
    bw (KB  /s): min= 1708, max=20320, per=25.11%, avg=5594.09, stdev=2139.92
    lat (usec) : 50=1.95%, 100=29.01%, 250=4.79%, 500=1.89%, 750=2.62%
    lat (usec) : 1000=4.91%
    lat (msec) : 2=23.26%, 4=28.13%, 10=3.37%, 20=0.03%, 100=0.05%
  cpu          : usr=0.33%, sys=2.01%, ctx=131942, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=6106: Tue Oct 27 21:28:30 2015
  write: io=1024.0MB, bw=5568.1KB/s, iops=696, runt=188290msec
    clat (usec): min=42, max=370664, avg=1433.07, stdev=2490.61
     lat (usec): min=42, max=370665, avg=1433.57, stdev=2490.61
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   52], 20.00th=[   57],
     | 30.00th=[   99], 40.00th=[  748], 50.00th=[ 1224], 60.00th=[ 1688],
     | 70.00th=[ 2064], 80.00th=[ 2512], 90.00th=[ 3120], 95.00th=[ 3696],
     | 99.00th=[ 5472], 99.50th=[ 6368], 99.90th=[ 8384], 99.95th=[15808],
     | 99.99th=[88576]
    bw (KB  /s): min= 1136, max=32736, per=24.86%, avg=5538.26, stdev=2457.55
    lat (usec) : 50=2.59%, 100=27.54%, 250=5.20%, 500=2.08%, 750=2.65%
    lat (usec) : 1000=4.96%
    lat (msec) : 2=23.34%, 4=28.18%, 10=3.38%, 20=0.02%, 100=0.05%
    lat (msec) : 500=0.01%
  cpu          : usr=0.34%, sys=1.99%, ctx=131977, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=6107: Tue Oct 27 21:28:30 2015
  write: io=1024.0MB, bw=5594.6KB/s, iops=699, runt=187430msec
    clat (usec): min=43, max=95350, avg=1426.48, stdev=2296.46
     lat (usec): min=44, max=95350, avg=1426.98, stdev=2296.46
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   52], 20.00th=[   57],
     | 30.00th=[   91], 40.00th=[  724], 50.00th=[ 1224], 60.00th=[ 1688],
     | 70.00th=[ 2064], 80.00th=[ 2512], 90.00th=[ 3120], 95.00th=[ 3664],
     | 99.00th=[ 5472], 99.50th=[ 6368], 99.90th=[ 8384], 99.95th=[19840],
     | 99.99th=[88576]
    bw (KB  /s): min= 1721, max=19600, per=25.09%, avg=5588.87, stdev=2090.35
    lat (usec) : 50=2.13%, 100=29.03%, 250=4.83%, 500=1.86%, 750=2.54%
    lat (usec) : 1000=4.88%
    lat (msec) : 2=23.00%, 4=28.33%, 10=3.32%, 20=0.02%, 50=0.01%
    lat (msec) : 100=0.05%
  cpu          : usr=0.34%, sys=2.00%, ctx=131974, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6137: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2853.1KB/s, iops=356, runt=183707msec
    clat (usec): min=42, max=187990, avg=2799.66, stdev=4060.55
     lat (usec): min=43, max=187991, avg=2800.22, stdev=4060.54
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   57],
     | 30.00th=[   82], 40.00th=[  900], 50.00th=[ 2288], 60.00th=[ 3312],
     | 70.00th=[ 4192], 80.00th=[ 5216], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[ 9920], 99.50th=[11840], 99.90th=[82432], 99.95th=[88576],
     | 99.99th=[98816]
    bw (KB  /s): min=  932, max=13179, per=12.44%, avg=2831.43, stdev=1444.23
    lat (usec) : 50=1.94%, 100=32.61%, 250=3.47%, 500=0.31%, 750=0.69%
    lat (usec) : 1000=1.63%
    lat (msec) : 2=6.81%, 4=19.83%, 10=31.73%, 20=0.79%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.17%, sys=1.01%, ctx=66500, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6138: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2859.4KB/s, iops=357, runt=183360msec
    clat (usec): min=42, max=187992, avg=2794.41, stdev=4065.04
     lat (usec): min=43, max=187993, avg=2794.97, stdev=4065.03
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   57],
     | 30.00th=[   79], 40.00th=[  844], 50.00th=[ 2288], 60.00th=[ 3280],
     | 70.00th=[ 4192], 80.00th=[ 5216], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[ 9920], 99.50th=[11456], 99.90th=[83456], 99.95th=[88576],
     | 99.99th=[97792]
    bw (KB  /s): min=  901, max=12016, per=12.57%, avg=2861.13, stdev=1447.42
    lat (usec) : 50=2.10%, 100=32.89%, 250=3.38%, 500=0.31%, 750=0.76%
    lat (usec) : 1000=1.58%
    lat (msec) : 2=6.57%, 4=19.72%, 10=31.71%, 20=0.79%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.17%, sys=1.01%, ctx=66423, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6139: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=3155.6KB/s, iops=394, runt=166150msec
    clat (usec): min=44, max=187919, avg=2531.86, stdev=4050.44
     lat (usec): min=44, max=187920, avg=2532.38, stdev=4050.43
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   51], 20.00th=[   54],
     | 30.00th=[   58], 40.00th=[   85], 50.00th=[ 1176], 60.00th=[ 2928],
     | 70.00th=[ 4080], 80.00th=[ 5152], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[ 9920], 99.50th=[11712], 99.90th=[59648], 99.95th=[88576],
     | 99.99th=[96768]
    bw (KB  /s): min= 1101, max= 7139, per=13.88%, avg=3159.46, stdev=1093.53
    lat (usec) : 50=3.11%, 100=40.59%, 250=4.22%, 500=0.20%, 750=0.41%
    lat (usec) : 1000=0.89%
    lat (msec) : 2=4.27%, 4=15.49%, 10=29.84%, 20=0.81%, 50=0.07%
    lat (msec) : 100=0.10%, 250=0.01%
  cpu          : usr=0.19%, sys=1.08%, ctx=66231, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6140: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2867.2KB/s, iops=358, runt=182863msec
    clat (usec): min=43, max=191913, avg=2786.81, stdev=4074.48
     lat (usec): min=44, max=191914, avg=2787.36, stdev=4074.47
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   56],
     | 30.00th=[   78], 40.00th=[  796], 50.00th=[ 2256], 60.00th=[ 3280],
     | 70.00th=[ 4192], 80.00th=[ 5216], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[10048], 99.50th=[11712], 99.90th=[82432], 99.95th=[88576],
     | 99.99th=[97792]
    bw (KB  /s): min=  934, max= 8842, per=12.55%, avg=2857.35, stdev=1336.87
    lat (usec) : 50=2.22%, 100=32.98%, 250=3.63%, 500=0.29%, 750=0.65%
    lat (usec) : 1000=1.50%
    lat (msec) : 2=6.42%, 4=19.68%, 10=31.58%, 20=0.84%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.17%, sys=1.01%, ctx=66473, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6141: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2946.9KB/s, iops=368, runt=177918msec
    clat (usec): min=42, max=187977, avg=2711.39, stdev=4068.11
     lat (usec): min=43, max=187977, avg=2711.92, stdev=4068.10
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   52], 20.00th=[   55],
     | 30.00th=[   69], 40.00th=[  104], 50.00th=[ 2064], 60.00th=[ 3216],
     | 70.00th=[ 4192], 80.00th=[ 5152], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[10048], 99.50th=[11712], 99.90th=[79360], 99.95th=[88576],
     | 99.99th=[96768]
    bw (KB  /s): min=  978, max= 8336, per=12.93%, avg=2943.69, stdev=1271.07
    lat (usec) : 50=2.62%, 100=35.55%, 250=3.83%, 500=0.23%, 750=0.58%
    lat (usec) : 1000=1.22%
    lat (msec) : 2=5.43%, 4=18.31%, 10=31.21%, 20=0.83%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.18%, sys=1.02%, ctx=66328, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6142: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2873.9KB/s, iops=359, runt=182438msec
    clat (usec): min=42, max=188059, avg=2780.28, stdev=4077.29
     lat (usec): min=43, max=188060, avg=2780.84, stdev=4077.28
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   52], 20.00th=[   56],
     | 30.00th=[   77], 40.00th=[  748], 50.00th=[ 2256], 60.00th=[ 3280],
     | 70.00th=[ 4192], 80.00th=[ 5216], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[ 9920], 99.50th=[11584], 99.90th=[82432], 99.95th=[88576],
     | 99.99th=[98816]
    bw (KB  /s): min=  948, max= 8640, per=12.63%, avg=2874.84, stdev=1353.37
    lat (usec) : 50=2.46%, 100=33.21%, 250=3.43%, 500=0.26%, 750=0.68%
    lat (usec) : 1000=1.53%
    lat (msec) : 2=6.19%, 4=19.58%, 10=31.70%, 20=0.77%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.15%, sys=1.04%, ctx=66473, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6143: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2845.5KB/s, iops=355, runt=184256msec
    clat (usec): min=41, max=188017, avg=2808.08, stdev=4073.73
     lat (usec): min=42, max=188018, avg=2808.63, stdev=4073.72
    clat percentiles (usec):
     |  1.00th=[   48],  5.00th=[   50], 10.00th=[   53], 20.00th=[   58],
     | 30.00th=[   83], 40.00th=[  964], 50.00th=[ 2320], 60.00th=[ 3280],
     | 70.00th=[ 4192], 80.00th=[ 5152], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[ 9920], 99.50th=[11712], 99.90th=[82432], 99.95th=[88576],
     | 99.99th=[98816]
    bw (KB  /s): min=  904, max=23168, per=12.22%, avg=2782.02, stdev=1713.18
    lat (usec) : 50=2.85%, 100=31.01%, 250=3.59%, 500=0.30%, 750=0.78%
    lat (usec) : 1000=1.75%
    lat (msec) : 2=7.06%, 4=20.05%, 10=31.66%, 20=0.74%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.17%, sys=1.01%, ctx=66511, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=6144: Tue Oct 27 21:28:30 2015
  write: io=524288KB, bw=2854.4KB/s, iops=356, runt=183683msec
    clat (usec): min=40, max=188055, avg=2799.30, stdev=4062.84
     lat (usec): min=40, max=188055, avg=2799.87, stdev=4062.82
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   51], 10.00th=[   53], 20.00th=[   57],
     | 30.00th=[   82], 40.00th=[  908], 50.00th=[ 2288], 60.00th=[ 3312],
     | 70.00th=[ 4192], 80.00th=[ 5152], 90.00th=[ 6368], 95.00th=[ 7392],
     | 99.00th=[10048], 99.50th=[11840], 99.90th=[82432], 99.95th=[88576],
     | 99.99th=[98816]
    bw (KB  /s): min=  992, max=11264, per=12.43%, avg=2830.35, stdev=1421.10
    lat (usec) : 50=1.78%, 100=32.55%, 250=3.62%, 500=0.30%, 750=0.77%
    lat (usec) : 1000=1.61%
    lat (msec) : 2=6.83%, 4=19.95%, 10=31.56%, 20=0.82%, 50=0.08%
    lat (msec) : 100=0.11%, 250=0.01%
  cpu          : usr=0.16%, sys=1.02%, ctx=66471, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=65536/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=36054KB/s, minb=36054KB/s, maxb=36054KB/s, mint=116333msec, maxt=116333msec

Run status group 1 (all jobs):
  WRITE: io=4096.0MB, aggrb=22953KB/s, minb=11476KB/s, maxb=11500KB/s, mint=182359msec, maxt=182734msec

Run status group 2 (all jobs):
  WRITE: io=4096.0MB, aggrb=22275KB/s, minb=5568KB/s, maxb=5594KB/s, mint=187430msec, maxt=188290msec

Run status group 3 (all jobs):
  WRITE: io=4096.0MB, aggrb=22763KB/s, minb=2845KB/s, maxb=3155KB/s, mint=166150msec, maxt=184256msec

Disk stats (read/write):
  sdb: ios=15/2117274, merge=0/2076358, ticks=784/2651916, in_queue=2652016, util=98.37%